Revit 2027 API
IPerformanceAdviserRule.GetName Method
 Retrieves the name of the rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetName()
Function GetName As String
String^ GetName()
abstract GetName : unit -> string
Return Value
String
 The name of the rule.
Remarks
 Method should return a short string naming the rule, typically as a one word in TitleCase. String should be localized.
See Also
Reference
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace